hey_results/2pods/hey_test_1
Getting access token...
10
1 requests done.
3 requests done.
5 requests done.
7 requests done.
9 requests done.
All requests done.

Summary:
  Total:	3.6600 secs
  Slowest:	1.1395 secs
  Fastest:	0.2411 secs
  Average:	0.3660 secs
  Requests/sec:	2.7322
  Total data:	38660 bytes
  Size/request:	3866 bytes

Detailed Report:

	DNS+dialup:
  		Average:	0.0379 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.3787 secs

	DNS-lookup:
  		Average:	0.0274 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.2737 secs

	Request Write:
  		Average:	0.0003 secs
  		Fastest:	0.0002 secs
  		Slowest:	0.0006 secs

	Response Wait:
  		Average:	0.3273 secs
  		Fastest:	0.2406 secs
  		Slowest:	0.7597 secs

	Response Read:
  		Average:	0.0004 secs
  		Fastest:	0.0001 secs
  		Slowest:	0.0006 secs

Status code distribution:
  [200]	10 responses

Response time histogram:
  0.241 [1]	|∎∎∎∎∎∎∎
  0.331 [6]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.421 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.511 [0]	|
  0.600 [0]	|
  0.690 [0]	|
  0.780 [0]	|
  0.870 [0]	|
  0.960 [0]	|
  1.050 [0]	|
  1.140 [1]	|∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.2449 secs
  25% in 0.2479 secs
  50% in 0.2745 secs
  75% in 0.3896 secs
  90% in 1.1395 secs
100
2 requests done.
3 requests done.
5 requests done.
7 requests done.
9 requests done.
11 requests done.
13 requests done.
15 requests done.
17 requests done.
19 requests done.
21 requests done.
23 requests done.
25 requests done.
27 requests done.
29 requests done.
31 requests done.
33 requests done.
34 requests done.
35 requests done.
37 requests done.
39 requests done.
41 requests done.
42 requests done.
44 requests done.
46 requests done.
47 requests done.
49 requests done.
51 requests done.
53 requests done.
55 requests done.
57 requests done.
59 requests done.
61 requests done.
63 requests done.
65 requests done.
67 requests done.
69 requests done.
71 requests done.
73 requests done.
74 requests done.
76 requests done.
77 requests done.
79 requests done.
81 requests done.
83 requests done.
85 requests done.
87 requests done.
89 requests done.
91 requests done.
93 requests done.
95 requests done.
97 requests done.
99 requests done.
All requests done.

Summary:
  Total:	27.2121 secs
  Slowest:	0.6630 secs
  Fastest:	0.2344 secs
  Average:	0.2721 secs
  Requests/sec:	3.6748
  Total data:	386600 bytes
  Size/request:	3866 bytes

Detailed Report:

	DNS+dialup:
  		Average:	0.0036 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.3580 secs

	DNS-lookup:
  		Average:	0.0026 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.2563 secs

	Request Write:
  		Average:	0.0003 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0008 secs

	Response Wait:
  		Average:	0.2678 secs
  		Fastest:	0.2340 secs
  		Slowest:	0.4875 secs

	Response Read:
  		Average:	0.0003 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0039 secs

Status code distribution:
  [200]	100 responses

Response time histogram:
  0.234 [1]	|∎
  0.277 [72]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.320 [14]	|∎∎∎∎∎∎∎∎
  0.363 [9]	|∎∎∎∎∎
  0.406 [0]	|
  0.449 [2]	|∎
  0.492 [1]	|∎
  0.534 [0]	|
  0.577 [0]	|
  0.620 [0]	|
  0.663 [1]	|∎

Latency distribution:
  10% in 0.2372 secs
  25% in 0.2412 secs
  50% in 0.2492 secs
  75% in 0.2839 secs
  90% in 0.3342 secs
  95% in 0.3576 secs
  99% in 0.6630 secs
1000
2 requests done.
4 requests done.
6 requests done.
8 requests done.
10 requests done.
12 requests done.
14 requests done.
16 requests done.
18 requests done.
19 requests done.
21 requests done.
23 requests done.
24 requests done.
26 requests done.
28 requests done.
29 requests done.
31 requests done.
33 requests done.
35 requests done.
37 requests done.
39 requests done.
40 requests done.
42 requests done.
44 requests done.
45 requests done.
47 requests done.
49 requests done.
51 requests done.
53 requests done.
55 requests done.
57 requests done.
59 requests done.
61 requests done.
63 requests done.
65 requests done.
66 requests done.
67 requests done.
69 requests done.
70 requests done.
72 requests done.
74 requests done.
76 requests done.
78 requests done.
80 requests done.
82 requests done.
84 requests done.
86 requests done.
87 requests done.
89 requests done.
90 requests done.
92 requests done.
94 requests done.
96 requests done.
98 requests done.
100 requests done.
101 requests done.
102 requests done.
104 requests done.
106 requests done.
107 requests done.
109 requests done.
110 requests done.
112 requests done.
114 requests done.
116 requests done.
118 requests done.
120 requests done.
122 requests done.
124 requests done.
126 requests done.
128 requests done.
129 requests done.
131 requests done.
133 requests done.
135 requests done.
137 requests done.
138 requests done.
140 requests done.
142 requests done.
144 requests done.
146 requests done.
148 requests done.
149 requests done.
150 requests done.
152 requests done.
154 requests done.
156 requests done.
158 requests done.
161 requests done.
162 requests done.
165 requests done.
167 requests done.
169 requests done.
171 requests done.
172 requests done.
174 requests done.
176 requests done.
177 requests done.
179 requests done.
181 requests done.
183 requests done.
185 requests done.
187 requests done.
189 requests done.
191 requests done.
192 requests done.
194 requests done.
196 requests done.
198 requests done.
200 requests done.
202 requests done.
204 requests done.
206 requests done.
208 requests done.
210 requests done.
211 requests done.
212 requests done.
213 requests done.
215 requests done.
217 requests done.
219 requests done.
221 requests done.
223 requests done.
225 requests done.
227 requests done.
229 requests done.
231 requests done.
233 requests done.
234 requests done.
236 requests done.
238 requests done.
241 requests done.
243 requests done.
245 requests done.
247 requests done.
249 requests done.
251 requests done.
253 requests done.
255 requests done.
257 requests done.
259 requests done.
261 requests done.
262 requests done.
264 requests done.
266 requests done.
268 requests done.
269 requests done.
271 requests done.
273 requests done.
275 requests done.
277 requests done.
279 requests done.
281 requests done.
283 requests done.
285 requests done.
287 requests done.
289 requests done.
291 requests done.
293 requests done.
295 requests done.
297 requests done.
300 requests done.
301 requests done.
303 requests done.
305 requests done.
307 requests done.
309 requests done.
311 requests done.
313 requests done.
315 requests done.
317 requests done.
319 requests done.
321 requests done.
323 requests done.
324 requests done.
325 requests done.
327 requests done.
329 requests done.
330 requests done.
333 requests done.
335 requests done.
337 requests done.
338 requests done.
340 requests done.
342 requests done.
344 requests done.
346 requests done.
348 requests done.
349 requests done.
351 requests done.
353 requests done.
355 requests done.
357 requests done.
359 requests done.
361 requests done.
362 requests done.
364 requests done.
367 requests done.
368 requests done.
370 requests done.
372 requests done.
374 requests done.
376 requests done.
379 requests done.
381 requests done.
383 requests done.
385 requests done.
387 requests done.
389 requests done.
391 requests done.
393 requests done.
395 requests done.
397 requests done.
399 requests done.
401 requests done.
402 requests done.
405 requests done.
406 requests done.
408 requests done.
410 requests done.
412 requests done.
414 requests done.
416 requests done.
418 requests done.
420 requests done.
422 requests done.
424 requests done.
426 requests done.
428 requests done.
430 requests done.
432 requests done.
434 requests done.
436 requests done.
438 requests done.
441 requests done.
442 requests done.
444 requests done.
446 requests done.
448 requests done.
450 requests done.
452 requests done.
454 requests done.
456 requests done.
458 requests done.
460 requests done.
462 requests done.
464 requests done.
466 requests done.
468 requests done.
470 requests done.
473 requests done.
475 requests done.
477 requests done.
479 requests done.
481 requests done.
483 requests done.
485 requests done.
487 requests done.
489 requests done.
491 requests done.
493 requests done.
495 requests done.
497 requests done.
499 requests done.
501 requests done.
503 requests done.
505 requests done.
507 requests done.
509 requests done.
511 requests done.
513 requests done.
515 requests done.
517 requests done.
519 requests done.
521 requests done.
524 requests done.
526 requests done.
528 requests done.
530 requests done.
532 requests done.
534 requests done.
535 requests done.
537 requests done.
539 requests done.
541 requests done.
543 requests done.
545 requests done.
547 requests done.
549 requests done.
551 requests done.
553 requests done.
555 requests done.
557 requests done.
559 requests done.
560 requests done.
561 requests done.
562 requests done.
564 requests done.
566 requests done.
568 requests done.
570 requests done.
572 requests done.
574 requests done.
576 requests done.
578 requests done.
580 requests done.
582 requests done.
584 requests done.
586 requests done.
588 requests done.
590 requests done.
592 requests done.
594 requests done.
596 requests done.
598 requests done.
600 requests done.
602 requests done.
604 requests done.
606 requests done.
608 requests done.
610 requests done.
612 requests done.
614 requests done.
616 requests done.
618 requests done.
620 requests done.
622 requests done.
624 requests done.
625 requests done.
627 requests done.
629 requests done.
631 requests done.
633 requests done.
636 requests done.
638 requests done.
640 requests done.
642 requests done.
644 requests done.
646 requests done.
648 requests done.
649 requests done.
651 requests done.
653 requests done.
655 requests done.
658 requests done.
660 requests done.
662 requests done.
664 requests done.
666 requests done.
667 requests done.
669 requests done.
671 requests done.
673 requests done.
675 requests done.
677 requests done.
679 requests done.
681 requests done.
684 requests done.
686 requests done.
688 requests done.
689 requests done.
690 requests done.
692 requests done.
694 requests done.
697 requests done.
699 requests done.
701 requests done.
703 requests done.
705 requests done.
707 requests done.
709 requests done.
710 requests done.
712 requests done.
714 requests done.
716 requests done.
718 requests done.
720 requests done.
722 requests done.
725 requests done.
727 requests done.
729 requests done.
731 requests done.
733 requests done.
735 requests done.
737 requests done.
739 requests done.
741 requests done.
744 requests done.
746 requests done.
748 requests done.
750 requests done.
752 requests done.
754 requests done.
756 requests done.
758 requests done.
760 requests done.
762 requests done.
764 requests done.
766 requests done.
768 requests done.
770 requests done.
772 requests done.
774 requests done.
776 requests done.
778 requests done.
780 requests done.
782 requests done.
784 requests done.
786 requests done.
788 requests done.
791 requests done.
793 requests done.
795 requests done.
796 requests done.
797 requests done.
799 requests done.
800 requests done.
802 requests done.
804 requests done.
806 requests done.
808 requests done.
810 requests done.
812 requests done.
814 requests done.
816 requests done.
818 requests done.
820 requests done.
821 requests done.
824 requests done.
825 requests done.
827 requests done.
829 requests done.
831 requests done.
833 requests done.
835 requests done.
837 requests done.
838 requests done.
840 requests done.
842 requests done.
844 requests done.
846 requests done.
847 requests done.
849 requests done.
851 requests done.
853 requests done.
855 requests done.
857 requests done.
859 requests done.
861 requests done.
863 requests done.
865 requests done.
867 requests done.
869 requests done.
871 requests done.
873 requests done.
875 requests done.
877 requests done.
880 requests done.
882 requests done.
883 requests done.
884 requests done.
886 requests done.
888 requests done.
890 requests done.
893 requests done.
895 requests done.
897 requests done.
899 requests done.
900 requests done.
902 requests done.
904 requests done.
907 requests done.
909 requests done.
911 requests done.
913 requests done.
915 requests done.
917 requests done.
919 requests done.
921 requests done.
923 requests done.
925 requests done.
927 requests done.
929 requests done.
931 requests done.
933 requests done.
935 requests done.
938 requests done.
940 requests done.
942 requests done.
944 requests done.
946 requests done.
948 requests done.
950 requests done.
952 requests done.
954 requests done.
956 requests done.
958 requests done.
960 requests done.
962 requests done.
965 requests done.
967 requests done.
969 requests done.
971 requests done.
973 requests done.
975 requests done.
977 requests done.
979 requests done.
981 requests done.
983 requests done.
985 requests done.
987 requests done.
989 requests done.
991 requests done.
993 requests done.
995 requests done.
997 requests done.
999 requests done.
All requests done.

Summary:
  Total:	259.7460 secs
  Slowest:	0.7305 secs
  Fastest:	0.2309 secs
  Average:	0.2597 secs
  Requests/sec:	3.8499
  Total data:	3866000 bytes
  Size/request:	3866 bytes

Detailed Report:

	DNS+dialup:
  		Average:	0.0024 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.3594 secs

	DNS-lookup:
  		Average:	0.0012 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.2548 secs

	Request Write:
  		Average:	0.0003 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0018 secs

	Response Wait:
  		Average:	0.2568 secs
  		Fastest:	0.2303 secs
  		Slowest:	0.7298 secs

	Response Read:
  		Average:	0.0003 secs
  		Fastest:	0.0001 secs
  		Slowest:	0.0010 secs

Status code distribution:
  [200]	1000 responses

Response time histogram:
  0.231 [1]	|
  0.281 [854]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.331 [89]	|∎∎∎∎
  0.381 [29]	|∎
  0.431 [8]	|
  0.481 [7]	|
  0.531 [2]	|
  0.581 [2]	|
  0.631 [3]	|
  0.680 [2]	|
  0.730 [3]	|

Latency distribution:
  10% in 0.2338 secs
  25% in 0.2364 secs
  50% in 0.2430 secs
  75% in 0.2597 secs
  90% in 0.2999 secs
  95% in 0.3343 secs
  99% in 0.5427 secs
client_id=test-client&client_secret=c05426ab-4c8f-4a9f-8281-9d5eee3a84b6&username=testuser&password=password&grant_type=password
Tokens: {"access_token":"eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJqWW1QU2ppNlFlc2hPbi1OYnl3eXRRLUY0UVdScnpINmJkbWhjTWozeHl3In0.eyJqdGkiOiI3NjczYjQxOS1iNWVjLTQxY2ItOWM5Ni0zNGJlOWMxMzc5YmQiLCJleHAiOjE0OTIxOTU3OTMsIm5iZiI6MCwiaWF0IjoxNDkxNzYzNzkzLCJpc3MiOiJodHRwOi8va2V5Y2xvYWsta2V5Y2xvYWstY2x1c3Rlci10ZXN0LmI2ZmYucmgtaWRldi5vcGVuc2hpZnRhcHBzLmNvbS9hdXRoL3JlYWxtcy90ZXN0IiwiYXVkIjoidGVzdC1jbGllbnQiLCJzdWIiOiIyY2Q3ZjMyOS1lYjFhLTQ4MDgtYTQxZC1lOGVkNDA5NjAwMTQiLCJ0eXAiOiJCZWFyZXIiLCJhenAiOiJ0ZXN0LWNsaWVudCIsImF1dGhfdGltZSI6MCwic2Vzc2lvbl9zdGF0ZSI6IjZjMzdlZjk5LTMzZTctNDRlZi05NTM3LTdhOTNmZTU3NTUxZCIsImFjciI6IjEiLCJjbGllbnRfc2Vzc2lvbiI6Ijg1N2MxMzkwLWNjY2UtNDE5Yy05Yjc5LWU1Mjk3Nzg1MDVmZiIsImFsbG93ZWQtb3JpZ2lucyI6W10sInJlYWxtX2FjY2VzcyI6eyJyb2xlcyI6WyJ1bWFfYXV0aG9yaXphdGlvbiJdfSwicmVzb3VyY2VfYWNjZXNzIjp7InRlc3QtY2xpZW50Ijp7InJvbGVzIjpbInVtYV9wcm90ZWN0aW9uIl19LCJhY2NvdW50Ijp7InJvbGVzIjpbIm1hbmFnZS1hY2NvdW50IiwibWFuYWdlLWFjY291bnQtbGlua3MiLCJ2aWV3LXByb2ZpbGUiXX19LCJuYW1lIjoidGVzdHVzZXIgIiwicHJlZmVycmVkX3VzZXJuYW1lIjoidGVzdHVzZXIiLCJnaXZlbl9uYW1lIjoidGVzdHVzZXIifQ.LGgReckBirxToeh4IhV4iwys1B0_p4dl-xIYETF8lG09hnEaZFWX8NsLqrBvlNzzwlvRlWa0SXw-D4GDAfsJqKF1DT8sO1JT39JlNx25_KnqmgyxSwIm8GCj0pFhwnkVGW6jE5xQ_-uD4xfw3PMkKOAXxwTy8q3FXuV_q466fadfVyL0hIVhSevKymxR0vmE3xN-sE1wpawDVHrwW1XcNCQwYw4M7WUprEh1kK44kW6M9zv-GaXfj-bc67Aa2i3VgIN88QOsM1rO7IqHUtrKEsOBDSKWO49e7AmOpyq61SU4JG090GVtR27_tIWO6qBPD6ggRvO6Xd4ycBIvqo03nA","expires_in":432000,"refresh_expires_in":1800,"refresh_token":"eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJqWW1QU2ppNlFlc2hPbi1OYnl3eXRRLUY0UVdScnpINmJkbWhjTWozeHl3In0.eyJqdGkiOiI3NGZhOWEwNy1mNjMyLTQ0OTMtOTFlOC00NzliYTVlMjJjMmIiLCJleHAiOjE0OTE3NjU1OTMsIm5iZiI6MCwiaWF0IjoxNDkxNzYzNzkzLCJpc3MiOiJodHRwOi8va2V5Y2xvYWsta2V5Y2xvYWstY2x1c3Rlci10ZXN0LmI2ZmYucmgtaWRldi5vcGVuc2hpZnRhcHBzLmNvbS9hdXRoL3JlYWxtcy90ZXN0IiwiYXVkIjoidGVzdC1jbGllbnQiLCJzdWIiOiIyY2Q3ZjMyOS1lYjFhLTQ4MDgtYTQxZC1lOGVkNDA5NjAwMTQiLCJ0eXAiOiJSZWZyZXNoIiwiYXpwIjoidGVzdC1jbGllbnQiLCJhdXRoX3RpbWUiOjAsInNlc3Npb25fc3RhdGUiOiI2YzM3ZWY5OS0zM2U3LTQ0ZWYtOTUzNy03YTkzZmU1NzU1MWQiLCJjbGllbnRfc2Vzc2lvbiI6Ijg1N2MxMzkwLWNjY2UtNDE5Yy05Yjc5LWU1Mjk3Nzg1MDVmZiIsInJlYWxtX2FjY2VzcyI6eyJyb2xlcyI6WyJ1bWFfYXV0aG9yaXphdGlvbiJdfSwicmVzb3VyY2VfYWNjZXNzIjp7InRlc3QtY2xpZW50Ijp7InJvbGVzIjpbInVtYV9wcm90ZWN0aW9uIl19LCJhY2NvdW50Ijp7InJvbGVzIjpbIm1hbmFnZS1hY2NvdW50IiwibWFuYWdlLWFjY291bnQtbGlua3MiLCJ2aWV3LXByb2ZpbGUiXX19fQ.IH1gTxHzreBggoQvHF14JlEb6XhODgE7ld4OPtMKd0oyxyIOrocrYVFPjTPu7Y37le9hYT7Z6RJjM6dmjJBcJ0iOh6Khm1f6oMANnnqnRMf30X80tgT5xCgUA22p0aFH8yug30yRt4iXhZ45aX4EkMIGZ80sreAL1Zj3GDGA4ypt8roCqxeE0lc7emsErWwh4Bpm77zZLh1NnoeCFldkQMPxyBMNmrzN_zGMkDGkbpN71XBsW1blQkoJ1IUHlz9uaF-2KSKV82SyaZRltgDxLp1DHwDvzljBi8ljegeaFXU5_8Lqee-Ut3luxSZgPpsPkfeQTgQzDxl_XbW0yYGrLQ","token_type":"bearer","id_token":"eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJqWW1QU2ppNlFlc2hPbi1OYnl3eXRRLUY0UVdScnpINmJkbWhjTWozeHl3In0.eyJqdGkiOiI0NWZmYTdkZi0wNWUyLTQ1OGYtOTBmMy0wMGIxNWRjNjRjYWUiLCJleHAiOjE0OTIxOTU3OTMsIm5iZiI6MCwiaWF0IjoxNDkxNzYzNzkzLCJpc3MiOiJodHRwOi8va2V5Y2xvYWsta2V5Y2xvYWstY2x1c3Rlci10ZXN0LmI2ZmYucmgtaWRldi5vcGVuc2hpZnRhcHBzLmNvbS9hdXRoL3JlYWxtcy90ZXN0IiwiYXVkIjoidGVzdC1jbGllbnQiLCJzdWIiOiIyY2Q3ZjMyOS1lYjFhLTQ4MDgtYTQxZC1lOGVkNDA5NjAwMTQiLCJ0eXAiOiJJRCIsImF6cCI6InRlc3QtY2xpZW50IiwiYXV0aF90aW1lIjowLCJzZXNzaW9uX3N0YXRlIjoiNmMzN2VmOTktMzNlNy00NGVmLTk1MzctN2E5M2ZlNTc1NTFkIiwiYWNyIjoiMSIsIm5hbWUiOiJ0ZXN0dXNlciAiLCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJ0ZXN0dXNlciIsImdpdmVuX25hbWUiOiJ0ZXN0dXNlciJ9.JgVizVswZQpBo9GVqy8a7Zn0O3nJeGx4f5TZ3dC4u5MBiRN_AoxuuwiDUHcmh_DfypcUx3QjXNR6mxqPY6rB92HMyXYiOyBj1qI2Ge1xR6QejezLwh84PHSheFfe2jRCEfHEN9ah4WNMTEfEtLgSodqPW-OEeaTDXyVvvNXH036uKVeew8U0leA9oe85V2hr9L9JJygx41ZHzA_W7Aswa08DZEWRWOIsvdo1sAxlenjp-8AUYsIVzib-FPWi2OXOUeqanmBMkNd7LtSaglXxIln5_d-muPOZXg6BAKiCLROgDThaO4mX8vhcWEg6uABj8KovzvTNvcUNZUODEIzZ1Q","not-before-policy":0,"session_state":"6c37ef99-33e7-44ef-9537-7a93fe57551d"}
Access token: eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJqWW1QU2ppNlFlc2hPbi1OYnl3eXRRLUY0UVdScnpINmJkbWhjTWozeHl3In0.eyJqdGkiOiI3NjczYjQxOS1iNWVjLTQxY2ItOWM5Ni0zNGJlOWMxMzc5YmQiLCJleHAiOjE0OTIxOTU3OTMsIm5iZiI6MCwiaWF0IjoxNDkxNzYzNzkzLCJpc3MiOiJodHRwOi8va2V5Y2xvYWsta2V5Y2xvYWstY2x1c3Rlci10ZXN0LmI2ZmYucmgtaWRldi5vcGVuc2hpZnRhcHBzLmNvbS9hdXRoL3JlYWxtcy90ZXN0IiwiYXVkIjoidGVzdC1jbGllbnQiLCJzdWIiOiIyY2Q3ZjMyOS1lYjFhLTQ4MDgtYTQxZC1lOGVkNDA5NjAwMTQiLCJ0eXAiOiJCZWFyZXIiLCJhenAiOiJ0ZXN0LWNsaWVudCIsImF1dGhfdGltZSI6MCwic2Vzc2lvbl9zdGF0ZSI6IjZjMzdlZjk5LTMzZTctNDRlZi05NTM3LTdhOTNmZTU3NTUxZCIsImFjciI6IjEiLCJjbGllbnRfc2Vzc2lvbiI6Ijg1N2MxMzkwLWNjY2UtNDE5Yy05Yjc5LWU1Mjk3Nzg1MDVmZiIsImFsbG93ZWQtb3JpZ2lucyI6W10sInJlYWxtX2FjY2VzcyI6eyJyb2xlcyI6WyJ1bWFfYXV0aG9yaXphdGlvbiJdfSwicmVzb3VyY2VfYWNjZXNzIjp7InRlc3QtY2xpZW50Ijp7InJvbGVzIjpbInVtYV9wcm90ZWN0aW9uIl19LCJhY2NvdW50Ijp7InJvbGVzIjpbIm1hbmFnZS1hY2NvdW50IiwibWFuYWdlLWFjY291bnQtbGlua3MiLCJ2aWV3LXByb2ZpbGUiXX19LCJuYW1lIjoidGVzdHVzZXIgIiwicHJlZmVycmVkX3VzZXJuYW1lIjoidGVzdHVzZXIiLCJnaXZlbl9uYW1lIjoidGVzdHVzZXIifQ.LGgReckBirxToeh4IhV4iwys1B0_p4dl-xIYETF8lG09hnEaZFWX8NsLqrBvlNzzwlvRlWa0SXw-D4GDAfsJqKF1DT8sO1JT39JlNx25_KnqmgyxSwIm8GCj0pFhwnkVGW6jE5xQ_-uD4xfw3PMkKOAXxwTy8q3FXuV_q466fadfVyL0hIVhSevKymxR0vmE3xN-sE1wpawDVHrwW1XcNCQwYw4M7WUprEh1kK44kW6M9zv-GaXfj-bc67Aa2i3VgIN88QOsM1rO7IqHUtrKEsOBDSKWO49e7AmOpyq61SU4JG090GVtR27_tIWO6qBPD6ggRvO6Xd4ycBIvqo03nA
{"rpt":"eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJqWW1QU2ppNlFlc2hPbi1OYnl3eXRRLUY0UVdScnpINmJkbWhjTWozeHl3In0.eyJqdGkiOiI3NjczYjQxOS1iNWVjLTQxY2ItOWM5Ni0zNGJlOWMxMzc5YmQiLCJleHAiOjE0OTIxOTU3OTMsIm5iZiI6MCwiaWF0IjoxNDkxNzYzNzkzLCJpc3MiOiJodHRwOi8va2V5Y2xvYWsta2V5Y2xvYWstY2x1c3Rlci10ZXN0LmI2ZmYucmgtaWRldi5vcGVuc2hpZnRhcHBzLmNvbS9hdXRoL3JlYWxtcy90ZXN0IiwiYXVkIjoidGVzdC1jbGllbnQiLCJzdWIiOiIyY2Q3ZjMyOS1lYjFhLTQ4MDgtYTQxZC1lOGVkNDA5NjAwMTQiLCJ0eXAiOiJCZWFyZXIiLCJhenAiOiJ0ZXN0LWNsaWVudCIsImF1dGhfdGltZSI6MCwic2Vzc2lvbl9zdGF0ZSI6IjZjMzdlZjk5LTMzZTctNDRlZi05NTM3LTdhOTNmZTU3NTUxZCIsIm5hbWUiOiJ0ZXN0dXNlciAiLCJnaXZlbl9uYW1lIjoidGVzdHVzZXIiLCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJ0ZXN0dXNlciIsImFjciI6IjEiLCJjbGllbnRfc2Vzc2lvbiI6Ijg1N2MxMzkwLWNjY2UtNDE5Yy05Yjc5LWU1Mjk3Nzg1MDVmZiIsImFsbG93ZWQtb3JpZ2lucyI6W10sInJlYWxtX2FjY2VzcyI6eyJyb2xlcyI6WyJ1bWFfYXV0aG9yaXphdGlvbiJdfSwicmVzb3VyY2VfYWNjZXNzIjp7InRlc3QtY2xpZW50Ijp7InJvbGVzIjpbInVtYV9wcm90ZWN0aW9uIl19LCJhY2NvdW50Ijp7InJvbGVzIjpbIm1hbmFnZS1hY2NvdW50IiwibWFuYWdlLWFjY291bnQtbGlua3MiLCJ2aWV3LXByb2ZpbGUiXX19LCJhdXRob3JpemF0aW9uIjp7InBlcm1pc3Npb25zIjpbeyJzY29wZXMiOlsiYWRtaW4iXSwicmVzb3VyY2Vfc2V0X2lkIjoiNTU4NmQzYTYtOTA1My00OGNjLTgzYjUtNWE0MzM5YWE2YTA2IiwicmVzb3VyY2Vfc2V0X25hbWUiOiJNeVNwYWNlIn1dfX0.GEqZWHQEuH1NYHoEv_x8ovjzK5aTjHnXuBIL-xX2vSaBfWLltuIu1v0RpcPlrl0MS4PiHeqic8KYROK7LClx07SfGOrN8MNitdVsmwX27LGsLU5rdTv8vwsPgA9_5_vibXbmWG0uGZcL7ExEGAW2h52Ent2R_UP7O8BSsd29vvuOY_Tm-_JmdOg0hG7wxYW9E6maLPhVojZatftH_rGjS_90furFnyU7Aw4Kcc81RBa4iAXWff3vWlLsqie1RDMMwHwPBNBqqbPPlePgYoEdLm4XSPOXkA40l2ntKarsTjnSqhR6j2lEQJP4uz5V7nMMkw0oQ2LgVgddM9TaZG_OnQ"}100
20 requests done.
60 requests done.
97 requests done.
All requests done.

Summary:
  Total:	1.5200 secs
  Slowest:	0.3131 secs
  Fastest:	0.1137 secs
  Average:	0.1454 secs
  Requests/sec:	65.7915
  Total data:	158800 bytes
  Size/request:	1588 bytes

Detailed Report:

	DNS+dialup:
  		Average:	0.0115 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.1222 secs

	DNS-lookup:
  		Average:	0.0010 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0113 secs

	Request Write:
  		Average:	0.0003 secs
  		Fastest:	0.0002 secs
  		Slowest:	0.0023 secs

	Response Wait:
  		Average:	0.1332 secs
  		Fastest:	0.1131 secs
  		Slowest:	0.1987 secs

	Response Read:
  		Average:	0.0002 secs
  		Fastest:	0.0001 secs
  		Slowest:	0.0014 secs

Status code distribution:
  [200]	100 responses

Response time histogram:
  0.114 [1]	|∎
  0.134 [69]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.154 [12]	|∎∎∎∎∎∎∎
  0.174 [5]	|∎∎∎
  0.193 [2]	|∎
  0.213 [1]	|∎
  0.233 [0]	|
  0.253 [0]	|
  0.273 [5]	|∎∎∎
  0.293 [1]	|∎
  0.313 [4]	|∎∎

Latency distribution:
  10% in 0.1168 secs
  25% in 0.1222 secs
  50% in 0.1259 secs
  75% in 0.1385 secs
  90% in 0.2551 secs
  95% in 0.2835 secs
  99% in 0.3131 secs
1000
66 requests done.
202 requests done.
378 requests done.
521 requests done.
655 requests done.
783 requests done.
937 requests done.
993 requests done.
994 requests done.
997 requests done.
All requests done.

Summary:
  Total:	21.8517 secs
  Slowest:	1.4059 secs
  Fastest:	0.1190 secs
  Average:	0.3418 secs
  Requests/sec:	45.7172
  Total data:	1586412 bytes
  Size/request:	1588 bytes

Detailed Report:

	DNS+dialup:
  		Average:	0.0137 secs
  		Fastest:	0.0000 secs
  		Slowest:	1.1492 secs

	DNS-lookup:
  		Average:	0.0011 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0219 secs

	Request Write:
  		Average:	0.0005 secs
  		Fastest:	0.0001 secs
  		Slowest:	0.0129 secs

	Response Wait:
  		Average:	0.3273 secs
  		Fastest:	0.1165 secs
  		Slowest:	0.8353 secs

	Response Read:
  		Average:	0.0003 secs
  		Fastest:	0.0001 secs
  		Slowest:	0.0062 secs

Status code distribution:
  [200]	999 responses

Response time histogram:
  0.119 [1]	|
  0.248 [252]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.376 [434]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.505 [197]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.634 [79]	|∎∎∎∎∎∎∎
  0.762 [22]	|∎∎
  0.891 [8]	|∎
  1.020 [5]	|
  1.149 [0]	|
  1.277 [0]	|
  1.406 [1]	|

Latency distribution:
  10% in 0.2051 secs
  25% in 0.2470 secs
  50% in 0.3114 secs
  75% in 0.3984 secs
  90% in 0.5172 secs
  95% in 0.5961 secs
  99% in 0.8221 secs

Error distribution:
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: net/http: request canceled (Client.Timeout exceeded while awaiting headers)
10000
110 requests done.
163 requests done.
216 requests done.
368 requests done.
512 requests done.
663 requests done.
791 requests done.
924 requests done.
1081 requests done.
1234 requests done.
1384 requests done.
1531 requests done.
1699 requests done.
1853 requests done.
2002 requests done.
2125 requests done.
2232 requests done.
2369 requests done.
2560 requests done.
2693 requests done.
2778 requests done.
2890 requests done.
2984 requests done.
3083 requests done.
3210 requests done.
3360 requests done.
3501 requests done.
3691 requests done.
3872 requests done.
4040 requests done.
4202 requests done.
4389 requests done.
4562 requests done.
4689 requests done.
4850 requests done.
5050 requests done.
5241 requests done.
5456 requests done.
5577 requests done.
5693 requests done.
5807 requests done.
5941 requests done.
6103 requests done.
6281 requests done.
6406 requests done.
6561 requests done.
6679 requests done.
6782 requests done.
6928 requests done.
7046 requests done.
7171 requests done.
7282 requests done.
7372 requests done.
7480 requests done.
7666 requests done.
7840 requests done.
7999 requests done.
8184 requests done.
8359 requests done.
8555 requests done.
8765 requests done.
8929 requests done.
9069 requests done.
9212 requests done.
9337 requests done.
9490 requests done.
9619 requests done.
9763 requests done.
9901 requests done.
9987 requests done.
All requests done.

Summary:
  Total:	35.7492 secs
  Slowest:	7.2140 secs
  Fastest:	0.1128 secs
  Average:	3.2556 secs
  Requests/sec:	278.0759
  Total data:	15681500 bytes
  Size/request:	1577 bytes

Detailed Report:

	DNS+dialup:
  		Average:	0.0833 secs
  		Fastest:	0.0000 secs
  		Slowest:	3.4578 secs

	DNS-lookup:
  		Average:	0.0288 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.6271 secs

	Request Write:
  		Average:	0.0009 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0895 secs

	Response Wait:
  		Average:	3.1706 secs
  		Fastest:	0.1123 secs
  		Slowest:	5.8330 secs

	Response Read:
  		Average:	0.0003 secs
  		Fastest:	0.0000 secs
  		Slowest:	0.0758 secs

Status code distribution:
  [200]	9875 responses
  [400]	66 responses

Response time histogram:
  0.113 [1]	|
  0.823 [117]	|∎
  1.533 [186]	|∎∎
  2.243 [220]	|∎∎
  2.953 [2909]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  3.663 [3799]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  4.374 [2127]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  5.084 [483]	|∎∎∎∎∎
  5.794 [63]	|∎
  6.504 [26]	|
  7.214 [10]	|

Latency distribution:
  10% in 2.5733 secs
  25% in 2.8471 secs
  50% in 3.1683 secs
  75% in 3.7284 secs
  90% in 4.2294 secs
  95% in 4.4208 secs
  99% in 5.0860 secs

Error distribution:
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44586->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44710->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44916->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45014->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44614->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44844->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44376->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:43478->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44172->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44638->52.3.37.96:80: read: connection reset by peer
  [25]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: net/http: request canceled (Client.Timeout exceeded while awaiting headers)
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:43812->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44800->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44682->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45098->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44670->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45062->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45156->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45046->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44690->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44744->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:43978->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44050->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44010->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44702->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45072->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44684->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44838->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:43806->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44870->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45052->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:45134->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44688->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44740->52.3.37.96:80: read: connection reset by peer
  [1]	Post http://keycloak-keycloak-cluster-test.b6ff.rh-idev.openshiftapps.com/auth/realms/test/authz/entitlement/test-client: read tcp 192.168.1.39:44540->52.3.37.96:80: read: connection reset by peer